[
    {
        "id": "01",
        "course_id": "9737a16cd6bec0266606a27ab968b4c223d2e858",
        "img": "https://i.postimg.cc/FF0PytMM/book8.jpg",
        "title": "Learn Mathematics",
        "details": "Mathematics (from Ancient Greek μάθημα; máthēma: 'knowledge, study, learning') is an area of knowledge that includes such topics as numbers (arithmetic and number theory),[2] formulas and related structures (algebra),[3] shapes and the spaces in which they are contained (geometry),[2] and quantities and their changes (calculus and analysis).[4][5][6] Most mathematical activity involves the use of pure reason to discover or prove the properties of abstract objects, which consist of either abstractions from nature or—in modern mathematics—entities that are stipulated with certain properties, called axioms. A mathematical proof consists of a succession of applications of some deductive rules to already known results, including previously proved theorems, axioms and (in case of abstraction from nature) some basic properties that are considered as true starting points of the theory under consideration.  Mathematics is used in science for modeling phenomena, which then allows predictions to be made from experimental laws. The independence of mathematical truth from any experimentation implies that the accuracy of such predictions depends only on the adequacy of the model. Inaccurate predictions, rather than being caused by incorrect mathematics, imply the need to change the mathematical model used. For example, the perihelion precession of Mercury could only be explained after the emergence of Einstein's general relativity, which replaced Newton's law of gravitation as a better mathematical model."
    },
    {
        "id": 2,
        "course_id": "766d4b303da48e0b85b1de493f01d57e0d1c661e",
        "img": "https://i.postimg.cc/gJHhgPvJ/book6.jpg",
        "title": "Learning NodeJS",
        "details": "Node.js (Node) is an open source development platform for executing JavaScript code server-side. Node is useful for developing applications that require a persistent connection from the browser to the server and is often used for real-time applications such as chat, news feeds and web push notifications. Node.js is intended to run on a dedicated HTTP server and to employ a single thread with one process at a time. Node.js applications are event-based and run asynchronously. Code built on the Node platform does not follow the traditional model of receive, process, send, wait, receive. Instead, Node processes incoming requests in a constant event stack and sends small requests one after the other without waiting for responses.  This is a shift away from mainstream models that run larger, more complex processes and run several threads concurrently, with each thread waiting for its appropriate response before moving on.  One of the major advantages of Node.js, according to its creator Ryan Dahl, is that it does not block input/output (I/O). Some developers are highly critical of Node.js and point out that if a single process requires a significant number of CPU cycles, the application will block and that the blocking can crash the application. Proponents of the Node.js model claim that CPU processing time is less of a concern because of the high number of small processes that Node code is based on."
    },
    {
        "id": 3,
        "course_id": "578f039d205c65bb9c9e807875b78de70a694af5",
        "img": "https://i.postimg.cc/fWFz1rBT/book5.jpg",
        "title": "What is ISLAM",
        "details": "Less than one hundred years after Muhammad’s death in 632 the first Muslim historians began to write about his life. These were Muhammad ibn Ishaq (d. 767), Muhammad ibn ‘Umar al-Waqidi (d. ca 820); Muhammad ibn Sa’d (d. 845); and Abu Jarir at-Tabari (d. 923). These scholars reconstructed their narrative from oral traditions and early documents, and through their effort we know more about Muhammad than we do of any other Prophet.  Nevertheless, we need to keep in mind that the stories of Muhammad’s life were written to satisfy contemporary norms and included miraculous and legendary stories that might be misinterpreted today. As we have noted with the stories surrounding the Axial Sages, the Old Testament and the Gospels, such accounts are not to be taken literally. According to Reza Aslan in No god but God, The Origins, Evolution, and Future of Islam they “function as prophetic topos: a conventional literacy theme that can be found in most mythologies. Like the infancy narratives in the Gospels, these stories are not intended to relate historical events, but to elucidate the mystery of the prophetic experience. They answer the questions: What does it mean to be a prophet? … It is not important whether the stories describing the childhood of Muhammad, Jesus or David are true. What is important is what these stories say about our prophets, our messiahs, our kings: that theirs is a holy and eternal vocation, established by God from the moment of creation.”  According to tradition, Muhammad was born in Mecca in 570, the year known as the Year of the Elephant, in which Mecca was miraculously saved.  Tradition tells that Abraha, the Abyssinian Christian ruler of Yemen, attacked Mecca with a herd of elephants imported from Africa. Abraha’s goal was to destroy the Ka’ba and make the Christian church at Sana’ the new religious center of the Arab world. The terrified Quraysh had never seen an elephant, much less a whole herd, so they ran to the mountains to escape, leaving the Ka’ba with no defense. But just as it was about to be attacked, the sky went dark as a flock of birds, each carrying a stone in its beak, rained down on the invading army which was forced to retreat.Less than one hundred years after Muhammad’s death in 632 the first Muslim historians began to write about his life. These were Muhammad ibn Ishaq (d. 767), Muhammad ibn ‘Umar al-Waqidi (d. ca 820); Muhammad ibn Sa’d (d. 845); and Abu Jarir at-Tabari (d. 923). These scholars reconstructed their narrative from oral traditions and early documents, and through their effort we know more about Muhammad than we do of any other Prophet.  Nevertheless, we need to keep in mind that the stories of Muhammad’s life were written to satisfy contemporary norms and included miraculous and legendary stories that might be misinterpreted today. As we have noted with the stories surrounding the Axial Sages, the Old Testament and the Gospels, such accounts are not to be taken literally. According to Reza Aslan in No god but God, The Origins, Evolution, and Future of Islam they “function as prophetic topos: a conventional literacy theme that can be found in most mythologies. Like the infancy narratives in the Gospels, these stories are not intended to relate historical events, but to elucidate the mystery of the prophetic experience. They answer the questions: What does it mean to be a prophet? … It is not important whether the stories describing the childhood of Muhammad, Jesus or David are true. What is important is what these stories say about our prophets, our messiahs, our kings: that theirs is a holy and eternal vocation, established by God from the moment of creation.”  According to tradition, Muhammad was born in Mecca in 570, the year known as the Year of the Elephant, in which Mecca was miraculously saved.  Tradition tells that Abraha, the Abyssinian Christian ruler of Yemen, attacked Mecca with a herd of elephants imported from Africa. Abraha’s goal was to destroy the Ka’ba and make the Christian church at Sana’ the new religious center of the Arab world. The terrified Quraysh had never seen an elephant, much less a whole herd, so they ran to the mountains to escape, leaving the Ka’ba with no defense. But just as it was about to be attacked, the sky went dark as a flock of birds, each carrying a stone in its beak, rained down on the invading army which was forced to retreat."
    },
    {
        "id": 4,
        "course_id": "8b7adb554c3d8b91c01d15e4f9f8d0e27dab6461",
        "img": "https://i.postimg.cc/L8Qv9mP1/book7.jpg",
        "title": "History of C#",
        "details": "The C# programming language was designed by Anders Hejlsberg from Microsoft in 2000 and was later approved as an international standard by Ecma (ECMA-334) in 2002 and ISO/IEC (ISO/IEC 23270) in 2003. Microsoft introduced C# along with .NET Framework and Visual Studio, both of which were closed-source. C# is one of the most popular programming languages ​​developed by Microsoft, along with the dot net framework development, which has been approved by ECMA-334 and ISO. C# was designed to be general-purpose, high-level, fully object-oriented, as well as a component-oriented programming language. Mr. Anders Hejlsberg is the creator of this widely used programming language. The language was based on C++ and Java, with additional extensions, libraries, and concepts for implementing different OOPS and component-oriented programming concepts."
    },
    {
        "id": 5,
        "course_id": "f1df57c8313bc5154906e650e1af07c2212311e1",
        "img": "https://i.postimg.cc/wjMpZ9Jr/book4.jpg",
        "title": "Reading the novel",
        "details": "In the novelist’s much-anticipated follow-up to My Year of Rest and Relaxation, Moshfegh takes readers to a medieval village where a motherless young boy navigates class systems and the supernatural as he gets fearfully close to the fiefdom’s rulers and priests. Known for crafting characters out of touch with reality in a brutally unblinking way, Moshfegh has been praised for making corruption and inequality “feel both uncanny and all too familiar” by Publishers Weekly."
    },
    {
        "id": 6,
        "course_id": "88581f06d289242ae7195672fec75234f9326207",
        "img": "https://i.postimg.cc/W36Ctygr/wp6599912-java-logo-wallpapers.jpg",
        "title": "History of JAVA and Learning",
        "details": "Java was created at Sun Microsystems, Inc., where James Gosling led a team of researchers in an effort to create a new language that would allow consumer electronic devices to communicate with each other. Work on the language began in 1991, and before long the team's focus changed to a new niche, the World Wide Web. Java was originally developed by James Gosling at Sun Microsystems. It was released in May 1995 as a core component of Sun Microsystems' Java platform. "
    },
    {
        "id": 7,
        "course_id": "4b4d2d53cca9b167919e580cdec55939e8f2b714",
        "img": "https://i.postimg.cc/Zn57n5Tt/wp3105546-python-wallpapers.png",
        "title": "Python history and learn",
        "details": "Python was conceived in the late 1980s by Guido van Rossum at Centrum Wiskunde & Informatica (CWI) in the Netherlands as a successor to the ABC programming language, which was inspired by SETL, capable of exception handling and interfacing with the Amoeba operating system. Its implementation began in December 1989. So, even though Python is still used all over the world in almost every industry you can imagine, it was conceived in the late 1980s. It was then implemented in 1989 by Guido van Rossum. That is right, like a good amount of other programming languages, Python has been around and has weather the test of time well. In fact, Python’s popularity only continues to rise. This upward trend shows no signs in stopping, leaving Python as a force to be reckoned with.  Guido van Rossum, often referred to as, Benevolent Dictator for Life (BDFL), is the principal author of the Python programming language. Guido van Rossum, has recently, however, stepped down as leader on July 12, 2018. Python itself is actually named after Monty Python’s Flying Circus. The first version of the code published by Van Rossum was labeled version 0.9.0. Even in this early version of code there were classes with inheritance, exception handling, functions, and many other major datatypes. Python’s userbase form comp.lang.python in 1994 was formed, leading to more growth and use of the language. As you can see, Python had a strong core foundation right out of the gate. It is no wonder the potential for this flexible language is being pushed everyday."
    },
    {
        "id": 8,
        "course_id": "8a852de452c6831d3b5579368bab56506ec629e6",
        "img": "https://i.postimg.cc/FHryQBs8/wp6600166-java-logo-wallpapers.jpg",
        "title": "Best JAVA program",
        "details": "Java is an Object-Oriented programming language developed by James Gosling in the early 1990s. The team initiated this project to develop a language for digital devices such as set-top boxes, television, etc. Originally C++ was considered to be used in the project but the idea was rejected for several reasons(For instance C++ required more memory). Gosling endeavoured to alter and expand C++ however before long surrendered that for making another stage called Green. James Gosling and his team called their project “Greentalk” and its file extension was .gt and later became to known as “OAK”. Why “Oak”? The name Oak was used by Gosling after an oak tree that remained outside his office. Also, Oak is an image of solidarity and picked as a national tree of numerous nations like the U.S.A., France, Germany, Romania, etc. But they had to later rename it as “JAVA” as it was already a trademark by Oak Technologies. “JAVA” Gosling and his team did a brainstorm session and after the session, they came up with several names such as JAVA, DNA, SILK, RUBY, etc. Java name was decided after much discussion since it was so unique. The name Java originates from a sort of espresso bean, Java. Gosling came up with this name while having a coffee near his office. Java was created on the principles like Robust, Portable, Platform Independent, High Performance, Multithread, etc. and was called one of the Ten Best Products of 1995 by the TIME MAGAZINE. Currently, Java is used in internet programming, mobile devices, games, e-business solutions, etc. The Java language has experienced a few changes since JDK 1.0 just as various augmentations of classes and packages to the standard library. In Addition to the language changes, considerably more sensational changes have been made to the Java Class Library throughout the years, which has developed from a couple of hundred classes in JDK 1.0 to more than three thousand"
    }
]